# Lesson 4 Practice: Pandas Part 2

Use this notebook to follow along with the lesson in the corresponding lesson notebook: [L04-Pandas_Part2-Lesson.ipynb](./L04-Pandas_Part2-Lesson.ipynb).

## Instructions
Follow along with the teaching material in the lesson. Throughout the tutorial sections labeled as "Tasks" are interspersed and indicated with the icon: ![Task](http://icons.iconarchive.com/icons/sbstnblnd/plateau/16/Apps-gnome-info-icon.png). You should follow the instructions provided in these sections by performing them in the practice notebook.  When the tutorial is completed you can turn in the final practice notebook. For each task, use the cell below it to write and test your code.  You may add additional cells for any task as needed or desired.

## Task 1a: Setup

- import pandas
- re-create the `df` data frame
- re-create the `iris_df` data frame

In [5]:
import pandas as pd
import numpy as np

df = pd.DataFrame(
    {'alpha': [0, 1, 2, 3, 4],
     'beta': ['a', 'b', 'c', 'd', 'e']})
iris_df = pd.read_csv('iris.csv')
df

   alpha beta
0      0    a
1      1    b
2      2    c
3      3    d
4      4    e

## Task 2a: Inserting Columns

+ Create a copy of the `df` dataframe.
+ Add a new column named "delta" to the copy that consists of random numbers.

In [8]:
df_delta = df
df_delta['delta'] = pd.Series(np.random.random(5))
df_delta

   alpha beta     delta
0      0    a  0.878697
1      1    b  0.802407
2      2    c  0.205982
3      3    d  0.176131
4      4    e  0.689448

## Task 3a: Missing Data

+ Create two new copies of the `df` dataframe:
+ Add a new column to both that has missing values.
+ In one copy, replace missing values with a value of your choice.
+ In the other copy, drop rows with `NaN` values.
+ Print both arrays to confirm.

In [17]:
df_copa = df.copy()
df_copb = df.copy()

df_copa['gamma'] = pd.Series([1,2,3])
df_copb['lamda'] = pd.Series([3,2,1])

df_copa = df_copa.fillna(2)
df_copb = df_copb.dropna()

print(df_copa)

df_copb

   alpha beta     delta  gamma
0      0    a  0.878697    1.0
1      1    b  0.802407    2.0
2      2    c  0.205982    3.0
3      3    d  0.176131    2.0
4      4    e  0.689448    2.0

   alpha beta     delta  lamda
0      0    a  0.878697    3.0
1      1    b  0.802407    2.0
2      2    c  0.205982    1.0

## Task 4a: Operations
<span style="float:right; margin-left:10px; clear:both;">![Task](./media/task-icon.png)</span>

View the [Computational tools](https://pandas.pydata.org/pandas-docs/stable/user_guide/computation.html) and [statistical methods](https://pandas.pydata.org/pandas-docs/stable/user_guide/computation.html#method-summary) documentation.
Using the list of operational functions choose five functions to use with the iris data frame.

In [22]:
print(iris_df.mean())
print(iris_df.median())
print(iris_df.min())
print(iris_df.max())
print(iris_df.var())

sepal_length    5.843333
sepal_width     3.054000
petal_length    3.758667
petal_width     1.198667
dtype: float64
sepal_length    5.80
sepal_width     3.00
petal_length    4.35
petal_width     1.30
dtype: float64
sepal_length       4.3
sepal_width          2
petal_length         1
petal_width        0.1
species         setosa
dtype: object
sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object
sepal_length    0.685694
sepal_width     0.188004
petal_length    3.113179
petal_width     0.582414
dtype: float64

## Task 4b:  Apply

Practice using `apply` on either the `df` or `iris_df` data frames using any two functions of your choice other than `print`, `type`, and `np.sum`.

In [27]:
print(iris_df.apply(type, 0))
print(iris_df.mean().apply(np.sum, 1))

sepal_length    <class 'pandas.core.series.Series'>
sepal_width     <class 'pandas.core.series.Series'>
petal_length    <class 'pandas.core.series.Series'>
petal_width     <class 'pandas.core.series.Series'>
species         <class 'pandas.core.series.Series'>
dtype: object
sepal_length    5.843333
sepal_width     3.054000
petal_length    3.758667
petal_width     1.198667
dtype: float64

## Task 4c.  Occurances
Ientify the number of occurances for each species (virginica, versicolor, setosa) in the `iris_df` object.  *Hint*: the `value_counts` function only works on a `pd.Series` object, not on the full data frame..

In [29]:
iris_df['species'].value_counts()

setosa        50
virginica     50
versicolor    50
Name: species, dtype: int64

## Task 5a: String Methods

+ Create a list of five strings that represent dates in the form YYYY-MM-DD (e.g. 2020-02-20 for Feb 20th, 2020).
+ Add this list of dates as a new column in the `df` dataframe.
+ Now split the date into 3 new columns with one column representing the year, another the month and another they day.
+ Combine the values from columns `alpha` and `beta` into a new column where the values are spearated with a colon.

In [31]:
date = ['1991-01-09', '2001-01-09', '2001-09-11', '2015-06-10', '2020-03-03']
df["dates"] = date
df['year'], df['month'], df['day'] = df['dates'].str.split('-', 2).str
df

   alpha beta     delta       dates  year month day
0      0    a  0.878697  1991-01-09  1991    01  09
1      1    b  0.802407  2001-01-09  2001    01  09
2      2    c  0.205982  2001-09-11  2001    09  11
3      3    d  0.176131  2015-06-10  2015    06  10
4      4    e  0.689448  2020-03-03  2020    03  03

## Task 6a: Concatenation by Rows
+ Create the following dataframe
```Python
df1 = pd.DataFrame(
    {'alpha': [0, 1, 2, 3, 4],
     'beta': ['a', 'b', 'c', 'd', 'e']}, index = ['I1', 'I2' ,'I3', 'I4', 'I5'])
```
+ Create a new dataframe named `df2` with column names "delta" and "gamma" that contins 5 rows with some index names that overlap with the `df1` dataframe and some that do not.
+ Concatenate the two dataframes by rows and print the result.
+ You should see the two have combined one after the other, but there should also be missing values added. 
+ Explain why there are missing values.

In [33]:
df1 = pd.DataFrame({'alpha': [0, 1, 2, 3, 4],'beta': ['a', 'b', 'c', 'd', 'e']}, index = ['I1', 'I2' ,'I3', 'I4', 'I5'])

df2 = pd.DataFrame({'delta': [4, 8, 15, 16, 23],'gamma': np.ones(5)}, index = ['I1', 'I2' ,'I3', 'I8', 'I9'])

df_comb = pd.concat([df1, df2], axis = 0)

df_comb # the missing values are where there are columns for each array, but there are no elements to fill all positions within the matrix

C:\Users\greys\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """

    alpha beta  delta  gamma
I1    0.0    a    NaN    NaN
I2    1.0    b    NaN    NaN
I3    2.0    c    NaN    NaN
I4    3.0    d    NaN    NaN
I5    4.0    e    NaN    NaN
I1    NaN  NaN    4.0    1.0
I2    NaN  NaN    8.0    1.0
I3    NaN  NaN   15.0    1.0
I8    NaN  NaN   16.0    1.0
I9    NaN  NaN   23.0    1.0

## Task 6b: Concatenation by Columns

Using the same dataframes, df1 and df2, from Task 6a practice:
+ Concatenate the two by columns
+ Add a "delta" column to `df1` and concatenate by columns such that there are 5 columns in the merged dataframe.
+ Respond in writing to this question (add a new 'raw' cell to contain your answer). What will happen if using you had performed an inner join while concatenating?  
+ Try the concatenation with the inner join to see if you are correct.

In [38]:
df1['delta'] = np.random.random(5)
df_concat = pd.concat([df1, df2], axis = 1)
df_concat2 = pd.concat([df1, df2], axis = 1, join = 'inner')
df_concat
df_concat2

C:\Users\greys\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

    alpha beta     delta  delta  gamma
I1      0    a  0.254579      4    1.0
I2      1    b  0.932491      8    1.0
I3      2    c  0.468689     15    1.0

#### Task 6c: Concat and append data frames
<span style="float:right; margin-left:10px; clear:both;">![Task](./media/task-icon.png)</span>

+ Create a new 5x5 dataframe full of random numbers.
+ Create a new 5x10 dataframe full of 1's.
+ Append one to the other and print it.
+ Append a single Series of zeros to the end of the appended dataframe.

In [44]:
df = pd.DataFrame(np.random.random((5,5)))
uno_df = pd.DataFrame(np.ones((10,10)))
print(df.append(uno_df), '\n')
print(uno_df.append(df))

          0         1         2         3         4    5    6    7    8    9
0  0.873381  0.389262  0.414529  0.074682  0.670701  NaN  NaN  NaN  NaN  NaN
1  0.279164  0.540715  0.115392  0.035134  0.072829  NaN  NaN  NaN  NaN  NaN
2  0.357957  0.358025  0.270738  0.553562  0.137114  NaN  NaN  NaN  NaN  NaN
3  0.066785  0.545624  0.422392  0.638577  0.564334  NaN  NaN  NaN  NaN  NaN
4  0.575391  0.786336  0.687596  0.240887  0.827395  NaN  NaN  NaN  NaN  NaN
0  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
1  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
2  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
3  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
4  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
5  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
6  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
7  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
8  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
9  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0

          0         1         2         3         4    5    6    7    8    9
0  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
1  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
2  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
3  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
4  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
5  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
6  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
7  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
8  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
9  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
0  0.873381  0.389262  0.414529  0.074682  0.670701  NaN  NaN  NaN  NaN  NaN
1  0.279164  0.540715  0.115392  0.035134  0.072829  NaN  NaN  NaN  NaN  NaN
2  0.357957  0.358025  0.270738  0.553562  0.137114  NaN  NaN  NaN  NaN  NaN
3  0.066785  0.545624  0.422392  0.638577  0.564334  NaN  NaN  NaN  NaN  NaN
4  0.575391  0.786336  0.687596  0.240887  0.827395  NaN  NaN  NaN  NaN  NaN

## Task 6d: Grouping

Demonstrate a `groupby`.

+ Create a new column with the label "region" in the iris data frame. This column will indicates geographic regions of the US where measurments were taken. Values should include:  'Southeast', 'Northeast', 'Midwest', 'Southwest', 'Northwest'. Use these randomly.
+ Use `groupby` to get a new data frame of means for each species in each region.
+ Add a `dev_stage` column by randomly selecting from the values "early" and "late".
+ Use `groupby` to get a new data frame of means for each species,in each region and each development stage.
+ Use the `count` function (just like you used the `mean` function) to identify how many rows in the table belong to each combination of species + region + developmental stage.

In [64]:
iris_df['region'] = np.random.choice(['Southeast', 'Northeast', 'Midwest', 'Southwest', 'Northwest'])
group_1 = iris_df.groupby(['species', 'region'])
iris_df['dev_stage'] = np.random.choice(['early', 'late'])
group_2 = iris_df.groupby(['species', 'region', 'dev_stage'])
print(group_1.count(), '\n')
group_2.count()

                      sepal_length  sepal_width  petal_length  petal_width  \
species    region
setosa     Northeast            50           50            50           50
versicolor Northeast            50           50            50           50
virginica  Northeast            50           50            50           50

                      dev_stage
species    region
setosa     Northeast         50
versicolor Northeast         50
virginica  Northeast         50

,,,sepal_length,sepal_width,petal_length,petal_width
species,region,dev_stage,,,,
setosa,Northeast,early,50,50,50,50
versicolor,Northeast,early,50,50,50,50
virginica,Northeast,early,50,50,50,50